doc/html/elements/template.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Template Element Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Template Element Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:46 CST"/>
<meta name="author" content="Rusty Klophaus (@rustyio)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Template Element Element</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Template Element - #template {}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Template Element - #template {}</h2>
<div class="outline-text-2" id="text-1">



<p>
  The template element allows you to specify html chrome for your page (header, footer, columns, etc.)
  while using a special placeholder syntax to call back to your page or any Erlang module.
</p>
<p>
  To specify a placeholder in the html template file, use the form:
</p>



<pre class="src src-erlang">[[[<span class="org-variable-name">Module</span>:<span class="org-variable-name">Function</span>(<span class="org-variable-name">Args</span>)]]]
</pre>


<p>
  Module can be any module, or can be the atom 'page' to refer to the0 currently Nitrogen page. 
  The function must return either one or more Nitrogen elements, an Erlang string, or 
  an Erlang binary.
</p>
<p>
  If the args are identifed like Erlang variables (capitalized first letter)
  such as MyArg1 (as opposed to a static value such as 5), then the template
  element will look in its bindings property for a matching element.
</p>
<p>
  It's also possible to specify alias module references to other modules. For example,
  the default module alias is actually <code>[{page, wf:page_module()}]</code>, which basically means
  "If you encounter page:function(Args), replace <code>page</code> with the current page's module." 
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">template</span> { files=<span class="org-string">"./priv/templates/myTemplate.html"</span>, bindings=[
  {<span class="org-string">'Binding1'</span>, binding1},
  {<span class="org-string">'Binding2'</span>, binding2}
]}
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">


<dl>
<dt>file - (<i>String</i>)</dt><dd>Path to an html template file, relative
      to the directory from which Erlang was started.

</dd>
<dt>bindings - (<i>Bindings, as expected by erl_eval</i>)</dt><dd>A list of
      variable bindings to be used for arguments specified in the
      template. Example: <code>[{'MyArg1', "Hello"}, {'MyArg2', "World"}]</code>

</dd>
<dt>module_aliases - (<i>proplist of {alias, actual_module} pairs</i>)</dt><dd>When 
      <code>alias</code> is encountered as the module of a Module:Function(Args) call,
      replace <code>alias</code> with <code>actual_module</code>.
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="./base.html">base element</a>
</li>
</ul>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:46 CST</p>
<p class="author">Author: Rusty Klophaus (@rustyio)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/template.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
